backend/src/app/controllers/users_controller.rb

  def create
    user = User.create! user_params
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"